--1. Напишете заявка, която извежда модел, честота и размер на диска за
--всички персонални компютри с цена под 1200 долара. Задайте
--псевдоними за атрибутите честота и размер на диска, съответно MHz и GB
SELECT MODEL, SPEED as MHz, HD as GB
FROM PC
WHERE PRICE < 1200

--2. Напишете заявка, която извежда производителите на принтери без
--повторения
SELECT DISTINCT MAKER
FROM PRODUCT
WHERE TYPE = 'Printer'

--3. Напишете заявка, която извежда модел, размер на паметта, размер на
--екран за лаптопите, чиято цена е над 1000 долара
SELECT MODEL, RAM, SCREEN
FROM LAPTOP
WHERE PRICE > 1000

--4. Напишете заявка, която извежда всички цветни принтери
SELECT *
FROM PRINTER
WHERE COLOR = 'y'
--5. Напишете заявка, която извежда модел, честота и размер на диска за
--тези персонални компютри със CD 12x или 16x и цена под 2000 долара.
SELECT MODEL, SPEED, HD
FROM PC
WHERE (CD = '12x' OR
       CD = '16x') AND
        PRICE < 2000